{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "int32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1606], "dtype": "int32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 13], "dtype": "float32", "input_dim": 19929, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 13}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, 1606], "dtype": "float32", "input_dim": 140675, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1606}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "global_max_pooling1d_2", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 6, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 34, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.11, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.159, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.23999999463558197, "momentum": 0.30300000309944153, "decay": 9.999999974752427e-07, "nesterov": true}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"], "weights": [{"name": "conv1d_1/kernel", "shape": [5, 100, 8], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [5, 100, 42], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [42], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [8, 6], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [42, 34], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [34], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [40, 128], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [128, 2], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [19929, 100], "dtype": "float32"}, {"name": "embedding_4/embeddings", "shape": [140675, 100], "dtype": "float32"}]}]}